Repository: pypi-data/pypi-mirror-324
Catalog: packages/django-email-validation/django_email_validation-2.1.1.tar.gz/django_email_validation-2.1.1/src/verify_email/locale/*/LC_MESSAGES/django.po
Languages: es, it

source: Email Verification Mail
es: Correo de verificación de dirección de correo electrónico
it: Mail di verifica dell'indirizzo email

source: email
es: Correo electrónico

source: Your Email is verified successfully and account has been activated. You can login with the credentials now...
es: Tu correo electrónico ha sido verificado con éxito y tu cuenta ha sido activada. Ahora puedes iniciar sesión con tus credenciales...
it: Il tuo indirizzo email è stato verificato con successo e il tuo account è stato attivato. Puoi ora accedere con i tuoi dati di accesso...

source: There is something wrong with this link, can't verify the user...
es: Hay algo mal con este enlace, no se puede verificar al usuario...
it: C'è qualcosa che non va con questo link, la verifica dell'utente impossibile...

source: Verify Email address
es: Verifique la dirección de correo electrónico
it: Verifica indirizzo email

source: Account Activation
es: Activación del cuenta
it: Attivazione dell'account

source: E-mail Confirmation
es: Confirmación del correo electrónico
it: Conferma dell'email

source: Greetings!
es: ¡Hola!
it: Ciao!

source: You received this mail because you attempted to make account on our website. Please click on the link below to confirm the email and activate your account.
es: Recibiste este correo electrónico porque intentaste crear una cuenta en nuestro sitio web. Por favor, haz clic en el enlace a continuación para confirmar tu dirección de correo electrónico y activar tu cuenta.
it: Hai ricevuto questo messaggio poiché hai tentato di creare un account sul nostro sito web. Per confermare l'indirizzo email e attivare il tuo account, clicca sul link qui sotto.

source: Please verify your e-mail :
es: Por favor, verifique su correo electrónico.
it: Per favore verifica la tua email.

source: You'll be joining us right after the verification !
es: Tú te unirás a nosotros justo después de la verificación.
it: Ti unirai appena dopo la verifica.

source: Thanks for joining! <br> This mail machine generated. <br>Do not reply to this mail
es: Gracias por unirse! <br> Este correo electrónico fue generado por una máquina. <br> No responda a este correo electrónico.
it: Grazie per aver partecipato! <br> Questo messaggio è stato generato da una macchina. <br> Non rispondi a questo messaggio.

source: Log In
es: Ingreso
it: Accedi

source: Link Expired!
es: El enlace ha expirado.
it: Link scaduto!

source: The link has lived its life :( Can not validate a dead link...
es: El enlace ha vivido su vida :(".
it: Il collegamento ha vissuto la sua vita :(".

source: Request Another one
es: Pida otro
it: Chiedere un altro

source: Request New Email for Verification
es: Solicitar un nuevo correo electrónico para verificación
it: Richiedi un nuovo indirizzo email per la verifica.

source: Request New Email
es: Solicitar una nueva dirección de correo electrónico.
it: Richiedi un nuovo indirizzo email

source: Usually this template needs to be changed by your own app's template
es: De manera habitual, este plantilla debe ser modificada por el plantilla de tu propia aplicación.
it: Di solito, questo modello deve essere modificato dal tuo stesso template dell'applicazione

source: Method not allowed
es: Metodo no permitido
it: Metodo non consentito

source: Verification Successful!
es: Verificación exitosa!
it: Verifica effettuata con successo!

source: There is something wrong with this link...
es: Hay algo mal con este enlace...
it: C'è qualcosa che non va con questo collegamento...

source: Verification Failed!
es: Verificación fallida!
it: Verifica fallita!

source: The link has lived its life :( Request a new one!
es: El enlace ha vivido su vida :(".
it: Il collegamento ha vissuto la sua vita :(" Richiedere uno nuovo!

source: Expired!
es: Expirado!
it: Scaduto!

source: This link was modified before verification.
es: Este enlace fue modificado antes de la verificación.
it: Questo collegamento è stato modificato prima della verifica.

source: Cannot request another verification link with faulty link.
es: No es posible solicitar otro enlace de verificación con un enlace defectuoso.
it: Non è possibile richiedere un altro link di verifica con il link difettoso.

source: Faulty Link Detected!
es: Error en el enlace detectado!
it: Link difettoso rilevato!

source: You have exceeded the maximum verification requests! Contact admin.
es: Has excedido el número máximo de solicitudes de verificación. Póngase en contacto con el administrador.
it: Hai superato il numero massimo di richieste di verifica! Contatta l'amministratore.

source: Maxed out!
es: Maximizado!
it: Massimo!

source: This link is invalid or been used already, we cannot verify using this link.
es: Este enlace no es válido o ya ha sido utilizado, por lo que no podemos verificar su uso con este enlace.
it: Questo link non è valido o è stato già utilizzato, non possiamo verificare la sua utilizzazione con questo link.

source: Invalid Link
es: Enlace inválido
it: Link non valido

source: 404 User not found
es: 404 Usuario no encontrado
it: 404 Utente non trovato

source: User is already active
es: El usuario ya está activo.
it: L'utente è già attivo.

source: You have requested another verification email!
es: Has solicitado otro correo electrónico de verificación!
it: Hai richiesto un'altra email di conferma!

source: Your verification link has been sent
es: Tu enlace de verificación ha sido enviado.
it: Il tuo link di verifica è stato inviato.

source: Email Sent!
es: Correo enviado!
it: Email inviato!

source: Something went wrong during sending email :(
es: Algo falló mientras se enviaba el correo electrónico :(
it: Qualcosa è andato storto durante la spedizione dell'email :-)

source: User not found associated with given email!
es: Usuario no encontrado asociado con la dirección de correo electrónico dada!
it: Utente non trovato associato all'indirizzo email dato!

source: User Not Found
es: Usuario no encontrado
it: Utente non trovato

source: Internal server error!
es: Error del servidor interno!
it: Errore di rete interna!

source: This user's account is already active
es: Este usuario tiene una cuenta activa.
it: Questo utente ha già un'account attivo.

source: Already Verified!
es: Ya verificado!
it: Già verificato!
