Repository: pypi-data/pypi-mirror-324
Catalog: packages/django-email-validation/django_email_validation-2.1.1-py3-none-any.whl/verify_email/locale/*/LC_MESSAGES/django.po
Languages: de, fr, pt

source: Email Verification Mail
de: E-Mail-Bestätigungs-Nachricht
fr: Courriel de vérification d'adresse mail
pt: Mai de Verificação de Endereço de Email

source: email
fr: courriel

source: Your Email is verified successfully and account has been activated. You can login with the credentials now...
de: Dein E-Mail-Adresse wurde erfolgreich verifiziert und dein Konto wurde aktiviert. Du kannst nun mit den Zugangsdaten einloggen...
fr: Ton Email a été vérifié avec succès et ton compte a été activé. Tu peux maintenant te connecter avec tes identifiants...
pt: Seu seu email foi verificado com sucesso e o seu conta foi ativada. Agora você pode se logar com seus detalhes...

source: There is something wrong with this link, can't verify the user...
de: Es gibt etwas Falsch mit diesem Link, die Authentifizierung des Benutzers kann nicht bestätigt werden.
fr: Quelque chose ne va pas avec ce lien, vérification de l'utilsateur impossible...
pt: Há algo errado com este link, não é possível verificar o usuário...

source: Verify Email address
de: Verifiziere die E-Mail-Adresse
fr: Vérifie l'adresse mail
pt: Verifique o endereço de e-mail

source: Account Activation
de: Kontoaktivierung
fr: Activation du compte
pt: Ativação da conta

source: E-mail Confirmation
de: E-Mail-Bestätigung
fr: Confirmation de l'e-mail
pt: Confirmação do e-mail

source: Greetings!
de: Grüße!
fr: Salut!
pt: Olá!

source: You received this mail because you attempted to make account on our website. Please click on the link below to confirm the email and activate your account.
de: Du hast dieses Mail erhalten, weil du versucht hast, ein Konto auf unserem Webportal zu erstellen. Bitte klicke auf den Link unten, um die E-Mail zu bestätigen und dein Konto zu aktivieren.
fr: Tu as reçu ce mail car tu as essayé de créer un compte sur notre site web. Merci de cliquer sur le lien ci-dessous pour confirmer l'adresse mail et activer ton compte
pt: Você recebeu esse e-mail porque tentou criar um cadastro em nosso site. Por favor, clique no link abaixo para confirmar a sua conta de e-mail e ativar seu cadastro.

source: Please verify your e-mail :
de: Bitte überprüfen Sie Ihr E-Mail.
fr: Merci de vérfier ton email
pt: Por favor, verifique seu e-mail.

source: You'll be joining us right after the verification !
de: Du wirst uns nach der Überprüfung rejoinen.
fr: Tu nous rejoindras juste après la vérification
pt: Você se juntará a nós exatamente após a verificação.

source: Thanks for joining! <br> This mail machine generated. <br>Do not reply to this mail
de: Danke für die Teilnahme! <br> Diese E-Mail wurde von einer Maschine generiert. <br> Bitte nicht auf diese E-Mail antworten.
fr: Merci de nous rejoindre! <br> Mail généré par une machine <br>Ne pas répondre
pt: Obrigado por se juntar! <br> Este e-mail foi gerado por uma máquina. <br> Não responda a este e-mail.

source: Log In
de: Anmelden
fr: Connexion
pt: Início de Sessão

source: Link Expired!
de: Verbindung abgelaufen!
fr: Lien expiré!
pt: Link Expirou!

source: The link has lived its life :( Can not validate a dead link...
de: Der Link hat seine Lebensdauer erreicht :(", "Es ist nicht möglich, einen toten Link zu validieren...
fr: Le lien a vécu sa vie :( Impossible de valider un lien mort...
pt: O link já viveu sua vida :(".

source: Request Another one
de: Andere anfordern
fr: En demander un autre
pt: Solicitar outro

source: Request New Email for Verification
de: Anforderung eines neuen E-Mail-Adressen für die Bestätigung
fr: Demander un nouveau mail de vérification
pt: Solicitar um novo email para verificação

source: Request New Email
de: Anforderung eines neuen E-Mail-Accounts
fr: Demander un nouveau mail
pt: Solicitar um novo e-mail

source: Usually this template needs to be changed by your own app's template
de: Normalerweise benötigt dieser Template Ihre eigene Anwendungstemplate.
fr: Normalement, ce template doit être modifié par le template de ta propre application
pt: Normalmente, este modelo precisa ser alterado pelo seu próprio template da aplicação.

source: Method not allowed
de: Methode nicht erlaubt
fr: Méthode interdite
pt: Método não permitido

source: Verification Successful!
de: Verifizierung erfolgreich!
fr: Vérification réussie!
pt: Verificação bem-sucedida!

source: There is something wrong with this link...
de: Es scheint, dass etwas mit diesem Link nicht stimmt.
fr: Quelque chose ne va pas avec ce lien...
pt: Há algo errado com este link...

source: Verification Failed!
de: Verifizierung fehlgeschlagen!
fr: Vérification échouée!
pt: Verificação falhou!

source: The link has lived its life :( Request a new one!
de: Der Link hat seine Lebensdauer erfüllt :(", Bitte einen neuen anfordern!
fr: Le lien a vécu sa vie :( En demander un autre!
pt: O link já passou por sua vida :(". "Solicite um novo!

source: Expired!
de: Abgelaufen!
fr: Expiré!
pt: Expirado!

source: This link was modified before verification.
de: Diese Verknüpfung wurde vor der Überprüfung geändert.
fr: Ce lien a été modifié avant vérification.
pt: Este link foi alterado antes da verificação.

source: Cannot request another verification link with faulty link.
de: Es ist nicht möglich, einen anderen Verifizierungslink mit einem defekten Link zu fordern.
fr: Impossible de demander un autre lien de vérification avec un lien défectueux.
pt: Não é possível solicitar um segundo link de verificação com um link defeituoso.

source: Faulty Link Detected!
de: Fehlerhafter Link erkannt!
fr: Lien défectueux détecté !
pt: Link defeituoso detectado!

source: You have exceeded the maximum verification requests! Contact admin.
de: Du hast die maximale Anzahl an Verifizierungsanfragen überschritten! Wende dich an den Administrator.
fr: Tu as dépassé le nombre maximum de demandes de vérification ! Contacte l'administrateur.
pt: Você excedeu o limite máximo de solicitações de verificação! Entre em contato com o administrador.

source: Maxed out!
de: Maximales erreicht!
fr: Au maximum !
pt: Maximizado!

source: This link is invalid or been used already, we cannot verify using this link.
de: Diese Verbindung ist ungültig oder bereits verwendet worden, wir können sie nicht überprüfen.
fr: Ce lien n'est pas valide ou a déjà été utilisé, nous ne pouvons pas vérifier l'utilisation de ce lien.
pt: Este link não é válido ou já foi usado, não podemos verificar usando este link.

source: Invalid Link
de: Ungültiger Link
fr: Lien invalide
pt: Link inválido

source: 404 User not found
de: 404 Benutzer nicht gefunden
fr: 404 Utilisateur non trouvé
pt: 404 Usuário não encontrado

source: User is already active
de: Benutzer ist bereits aktiv
fr: Utilisateur déjà actif
pt: O usuário já está ativo.

source: You have requested another verification email!
de: Du hast eine weitere Überprüfungsmail angefordert!
fr: Tu as demandé un autre courriel de vérification !
pt: Você pediu outro e-mail de verificação!

source: Your verification link has been sent
de: Dein Verifizierungslink wurde gesendet.
fr: Ton lien de vérification a été envoyé
pt: O seu link de verificação foi enviado

source: Email Sent!
de: E-Mail gesendet!
fr: Courriel envoyé !
pt: E-mail enviado!

source: Something went wrong during sending email :(
de: Etwas ist schiefgegangen beim Versenden des E-Mails :-)
fr: Un problème s'est produit lors de l'envoi du courriel :(
pt: Algo deu errado ao enviar o e-mail :-(

source: User not found associated with given email!
de: Benutzer nicht gefunden, der mit dem angegebenen E-Mail verknüpft ist!
fr: Utilisateur non trouvé associé à l'email donné !
pt: Usuário não encontrado associado às informações de e-mail fornecidas!

source: User Not Found
de: Benutzer nicht gefunden
fr: Utilisateur non trouvé
pt: Usuário não encontrado

source: Internal server error!
de: Interner Serverfehler!
fr: Erreur de serveur interne !
pt: Erro Interno do Servidor!

source: This user's account is already active
de: Dieses Benutzer-Konto ist bereits aktiv.
fr: Le compte de cet utilisateur est déjà actif
pt: Este usuário já tem sua conta ativa.

source: Already Verified!
de: Schon verifiziert!
fr: Déjà vérifié !
pt: Já Verificado!
